/*
Сумма трех чисел
Ввести три числа, найти их сумму.

Формат входных данных
Три целых числа

Формат результата
Строка вида %d+%d+%d=%d
*/

#include <stdio.h>

int main (void)
{
    int a, b, c, sum; //объявляем переменные

    //printf("Input 3 number:\n");
    scanf("%d%d%d", &a, &b, &c); //считать 3 числа
    sum = a + b + c; //сложить три числа и поместить в d
    printf("%d+%d+%d=%d", a, b, c, sum); //вывести на экран сумму 3 чисел

    return 0;
}
