/*
В порядке возрастания
Ввести три числа и определить, верно ли, что они вводились в порядке возрастания.

Input format
Три целых числа

Output format
Одно слово YES или NO
*/

/*
суть "Правда ли, что среднее число "c" больше, чем оба соседа — "a" и" b"?"

нам надо сравнить первое(1) число с третьим(3) и третие(3) чиcло со вторым (2)

если "среднее число" в нашем случае это "с" больше "a" и "b" то тогда числа
вводились в порядке возрастания, если нет то значит не в порядке возастания
*/

#include <stdio.h>
#include <inttypes.h>

int main(void)
{
    int16_t a, b, c;
    scanf("%" SCNd16 "%" SCNd16 "%" SCNd16, &a, &b, &c);
    if (a < c && c > b) {
        printf("YES");
    }
    else{
        printf("NO");
    }

    return 0;
}
